#Напишите программу для. проверки истинности утверждения ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат.
x = int(input("X >> "))
y = int(input("Y >> "))
z = int(input("Z >> "))

if (not (x or y or z) == (not x)):
   print ("kolsdifhpaodfjh23") 
else:
    print("2903420394823")